Tekla Open API Reference for Tekla Structures 2025
AnalysisObject Properties
The AnalysisObject type exposes the following members.
Properties
Name | Description
AnalysisModelName
 Gets or sets the analysis model name.
AnalysisObjectType
 Gets or sets the type of the analysis object.
FatherObject2ID
 Gets or sets the identifier of the father part.
FatherObject2Type
 Gets or sets the type of the father object.
FatherObjectID
 Gets or sets the identifier of the father part.
FatherObjectType
 Gets or sets the type of the father object.
ID
 Gets or sets the identifier of the analysis object.
Top
See Also
Reference
AnalysisObject Class
Tekla.Structures.Analysis Namespace